# -----------------------Tasks-----------------------
# 1. Перевірка віку:
# Запитай у користувача вік. Якщо йому 18 або більше — виведи "Повнолітній", інакше — "Неповнолітній".

# 2. Парне чи непарне:
# Запитай число, визначи, чи воно парне (ділиться на 2 без остачі).

# 3. Оцінка по балу:
# Запитай число (0–100). Якщо >= 90 — "Відмінно", 70–89 — "Добре", менше — "Слабко".

# 4. Вгадай число:
# В програмі є число (наприклад 7). Користувач вводить своє. Програма відповідає — вгадав чи ні.
#-----------------------------------------------------
# -----------------------Solutions--------------------


#task 1
age = int(input('Enter ur age:'))
if age >= 18 :
    print ('Повнолітній')
else:
    print ('Неповнолітній')

#task 2
num = int(input('Enter a number:'))
if num % 2 == 0:
    print ('Парне')
else:
    print ('Непарне')

#task 3
score = int(input('Enter a number (0-100):'))
if score >= 90:
    print ('Відмінно')
elif score >= 70 and score < 90:
    print ('Добре')
else:
    print ('Слабко')

#task 4
number = range(1, 10)
user_number = int(input('Enter a number: (1-10):'))
if user_number in number:
    print ('Вгадав')
else:
    print ('Не вгадав')
